tiborsimon/embedded-tdd-headers/pic/8bit/pic18f23k22_tdd.h
#define SPBRG2                        522
#define SP2BRG                        523
#define SPBRGH2                       524
#define SP2BRGH                       525
#define CM2CON1                       526
#define C2SYNC                        527
#define C1SYNC                        528
#define C2HYS                         529
#define C1HYS                         530
#define C2RSEL                        531
#define C1RSEL                        532
#define MC2OUT                        533
#define MC1OUT                        534
#define CM2CON0                       535
#define CCH02                         536
#define C2CH0                         537
#define C2CH                          538
#define C2CH1                         539
#define CCH12                         540
#define C2R                           541
#define CREF2                         542
#define EVPOL02                       543
#define C2SP                          544
#define EVPOL12                       545
#define C2POL                         546
#define CPOL2                         547
#define C2OE                          548
#define CM2CON0_C2OUT                 549
#define COE2                          550
#define CON2                          551
#define C2ON                          552
#define CM1CON0                       553
#define C1CH0                         554
#define C1CH                          555
#define CCH01                         556
#define CCH0                          557
#define CCH11                         558
#define C1CH1                         559
#define CCH1                          560
#define CREF1                         561
#define C1R                           562
#define CREF                          563
#define EVPOL01                       564
#define EVPOL0                        565
#define C1SP                          566
#define EVPOL1                        567
#define EVPOL11                       568
#define C1POL                         569
#define C1OE                          570
#define CPOL                          571
#define CPOL1                         572
#define COE                           573
#define CM1CON0_C1OUT                 574
#define COE1                          575
#define CON                           576
#define C1ON                          577
#define CON1                          578
#define PIE4                          579
#define CCP3IE                        580
#define CCP4IE                        581
#define CCP5IE                        582
#define PIR4                          583
#define CCP3IF                        584
#define CCP4IF                        585
#define CCP5IF                        586
#define IPR4                          587
#define CCP3IP                        588
#define CCIP3IP                       589
#define CCP4IP                        590
#define CCP5IP                        591
#define PIE5                          592
#define TMR4IE                        593
#define TMR5IE                        594
#define TMR6IE                        595
#define PIR5                          596
#define TMR4IF                        597
#define TMR5IF                        598
#define TMR6IF                        599
#define IPR5                          600
#define TMR4IP                        601
#define CCH05                         602
#define CCH15                         603
#define TMR5IP                        604
#define TMR6IP                        605
#define PORTA                         606
#define ULPWUIN                       607
#define AN0                           608
#define PORTA_RA0                     609
#define C12IN0M                       610
#define C12IN0N                       611
#define AN1                           612
#define C12IN1N                       613
#define C12IN1M                       614
#define PORTA_RA1                     615
#define AN2                           616
#define DACOUT                        617
#define PORTA_RA2                     618
#define CVREF                         619
#define VREFN                         620
#define VREFM                         621
#define C2INP                         622
#define C1INP                         623
#define AN3                           624
#define PORTA_RA3                     625
#define VREFP                         626
#define CCP5                          627
#define PORTA_C1OUT                   628
#define PORTA_RA4                     629
#define T0CKI                         630
#define SRQ                           631
#define PORTA_C2OUT                   632
#define SS1                           633
#define AN4                           634
#define PORTA_RA5                     635
#define NOT_SS                        636
#define nSS1                          637
#define NOT_SS1                       638
#define LVDIN                         639
#define nSS                           640
#define SS                            641
#define SRNQ                          642
#define HLVDIN                        643
#define PORTA_RA6                     644
#define PORTA_RA7                     645
#define RJPU                          646
#define PORTB                         647
#define CCP4                          648
#define FLT0                          649
#define INT0                          650
#define NOT_SS2                       651
#define nSS2                          652
#define SRI                           653
#define SS2                           654
#define PORTB_RB0                     655
#define AN12                          656
#define C12IN3M                       657
#define P1C                           658
#define SCK2                          659
#define C12IN3N                       660
#define INT1                          661
#define SCL2                          662
#define PORTB_RB1                     663
#define AN10                          664
#define AN8                           665
#define INT2                          666
#define P1B                           667
#define SDI2                          668
#define SDA2                          669
#define CTED1                         670
#define PORTB_RB2                     671
#define AN9                           672
#define PORTB_CCP2                    673
#define CCP2_PA2                      674
#define SDO2                          675
#define C12IN2N                       676
#define CTED2                         677
#define C12IN2M                       678
#define PORTB_RB3                     679
#define PORTB_P2A                     680
#define PORTB_RB4                     681
#define P1D                           682
#define KBI0                          683
#define T5G                           684
#define AN11                          685
#define PORTB_CCP3                    686
#define PORTB_RB5                     687
#define T1G                           688
#define KBI1                          689
#define PORTB_P2B                     690
#define PORTB_P3A                     691
#define AN13                          692
#define PORTB_T3CKI                   693
#define PGC                           694
#define CK2                           695
#define KBI2                          696
#define TX2                           697
#define PORTB_RB6                     698
#define PGD                           699
#define RX2                           700
#define PORTB_RB7                     701
#define KBI3                          702
#define DT2                           703
#define PORTC                         704
#define T1CKI                         705
#define T1OSO                         706
#define PORTC_T3CKI                   707
#define PORTC_RC0                     708
#define T3G                           709
#define PORTC_P2B                     710
#define PORTC_CCP2                    711
#define PORTC_P2A                     712
#define PORTC_RC1                     713
#define T1OSI                         714
#define PA2                           715
#define CCP1                          716
#define CTPLS                         717
#define P1A                           718
#define T5CKI                         719
#define PA1                           720
#define AN14                          721
#define PORTC_RC2                     722
#define SCK1                          723
#define SCL                           724
#define SCK                           725
#define SCL1                          726
#define AN15                          727
#define PORTC_RC3                     728
#define PORTC_RC4                     729
#define SDI1                          730
#define SDA1                          731
#define AN16                          732
#define SDA                           733
#define SDI                           734
#define PORTC_RC5                     735
#define SDO1                          736
#define AN17                          737
#define SDO                           738
#define PORTC_CCP3                    739
#define PORTC_RC6                     740
#define PORTC_P3A                     741
#define CK                            742
#define TX1                           743
#define TX                            744
#define CK1                           745
#define AN18                          746
#define DT                            747
#define RX                            748
#define RX1                           749
#define P3B                           750
#define PORTC_RC7                     751
#define DT1                           752
#define AN19                          753
#define PORTE                         754
#define VPP                           755
#define RE3                           756
#define NOT_MCLR                      757
#define MCLR                          758
#define CCP9E                         759
#define nMCLR                         760
#define PC3E                          761
#define LATA                          762
#define LATA0                         763
#define LA0                           764
#define LATA1                         765
#define LA1                           766
#define LATA2                         767
#define LA2                           768
#define LATA3                         769
#define LA3                           770
#define LATA4                         771
#define LA4                           772
#define LATA5                         773
#define LA5                           774
#define LATA6                         775
#define LA6                           776
#define LATA7                         777
#define LA7                           778
#define LATB                          779
#define LB0                           780
#define LATB0                         781
#define LB1                           782
#define LATB1                         783
#define LB2                           784
#define LATB2                         785
#define LB3                           786
#define LATB3                         787
#define LB4                           788
#define LATB4                         789
#define LB5                           790
#define LATB5                         791
#define LB6                           792
#define LATB6                         793
#define LB7                           794
#define LATB7                         795
#define LATC                          796
#define LATC0                         797
#define LC0                           798
#define LATC1                         799
#define LC1                           800
#define LATC2                         801
#define LC2                           802
#define LATC3                         803
#define LC3                           804
#define LATC4                         805
#define LC4                           806
#define LATC5                         807
#define LC5                           808
#define LATC6                         809
#define LC6                           810
#define LATC7                         811
#define LC7                           812
#define TRISA                         813
#define TRISA0                        814
#define TRISA_RA0                     815
#define TRISA1                        816
#define TRISA_RA1                     817
#define TRISA2                        818
#define TRISA_RA2                     819
#define TRISA3                        820
#define TRISA_RA3                     821
#define TRISA_RA4                     822
#define TRISA4                        823
#define TRISA_RA5                     824
#define TRISA5                        825
#define TRISA_RA6                     826
#define TRISA6                        827
#define TRISA_RA7                     828
#define TRISA7                        829
#define TRISB                         830
#define TRISB_RB0                     831
#define TRISB0                        832
#define TRISB_RB1                     833
#define TRISB1                        834
#define TRISB_RB2                     835
#define TRISB2                        836
#define TRISB_RB3                     837
#define TRISB3                        838
#define TRISB_RB4                     839
#define TRISB4                        840
#define TRISB_RB5                     841
#define TRISB5                        842
#define TRISB_RB6                     843
#define TRISB6                        844
#define TRISB_RB7                     845
#define TRISB7                        846
#define TRISC                         847
#define TRISC0                        848
#define TRISC_RC0                     849
#define TRISC1                        850
#define TRISC_RC1                     851
#define TRISC2                        852
#define TRISC_RC2                     853
#define TRISC3                        854
#define TRISC_RC3                     855
#define TRISC4                        856
#define TRISC_RC4                     857
#define TRISC5                        858
#define TRISC_RC5                     859
#define TRISC6                        860
#define TRISC_RC6                     861
#define TRISC7                        862
#define TRISC_RC7                     863
#define TRISE                         864
#define WPUE3                         865
#define OSCTUNE                       866
#define TUN0                          867
#define TUN                           868
#define TUN1                          869
#define TUN2                          870
#define TUN3                          871
#define TUN4                          872
#define TUN5                          873
#define PLLEN                         874
#define INTSRC                        875
#define HLVDCON                       876
#define HLVDL                         877
#define HLVDL0                        878
#define LVV0                          879
#define LVDL0                         880
#define LVV1                          881
#define HLVDL1                        882
#define LVDL1                         883
#define HLVDL2                        884
#define LVV2                          885
#define LVDL2                         886
#define HLVDL3                        887
#define LVV3                          888
#define LVDL3                         889
#define HLVDEN                        890
#define LVDEN                         891
#define BGST                          892
#define IRVST                         893
#define IVRST                         894
#define BGVST                         895
#define VDIRMAG                       896
#define PIE1                          897
#define TMR1IE                        898
#define TMR2IE                        899
#define CCP1IE                        900
#define SSP1IE                        901
#define SSPIE                         902
#define TXIE                          903
#define TX1IE                         904
#define RC1IE                         905
#define RCIE                          906
#define ADIE                          907
#define PIR1                          908
#define TMR1IF                        909
#define TMR2IF                        910
#define CCP1IF                        911
#define SSPIF                         912
#define SSP1IF                        913
#define TXIF                          914
#define TX1IF                         915
#define RCIF                          916
#define RC1IF                         917
#define ADIF                          918
#define IPR1                          919
#define TMR1IP                        920
#define TMR2IP                        921
#define CCP1IP                        922
#define SSPIP                         923
#define SSP1IP                        924
#define TX1IP                         925
#define TXIP                          926
#define RCIP                          927
#define RC1IP                         928
#define ADIP                          929
#define PIE2                          930
#define CCP2IE                        931
#define TMR3IE                        932
#define HLVDIE                        933
#define LVDIE                         934
#define BCL1IE                        935
#define BCLIE                         936
#define EEIE                          937
#define C2IE                          938
#define C1IE                          939
#define CMIE                          940
#define OSCFIE                        941
#define PIR2                          942
#define CCP2IF                        943
#define TMR3IF                        944
#define HLVDIF                        945
#define LVDIF                         946
#define BCL1IF                        947
#define BCLIF                         948
#define EEIF                          949
#define C2IF                          950
#define C1IF                          951
#define CMIF                          952
#define OSCFIF                        953
#define IPR2                          954
#define CCP2IP                        955
#define TMR3IP                        956
#define HLVDIP                        957
#define LVDIP                         958
#define BCLIP                         959
#define BCL1IP                        960
#define EEIP                          961
#define C2IP                          962
#define C1IP                          963
#define CMIP                          964
#define OSCFIP                        965
#define PIE3                          966
#define RXB0IE                        967
#define TMR1GIE                       968
#define RXBNIE                        969
#define TMR3GIE                       970
#define RXB1IE                        971
#define TMR5GIE                       972
#define TXB0IE                        973
#define CTMUIE                        974
#define TXB1IE                        975
#define TXBNIE                        976
#define TXB2IE                        977
#define TX2IE                         978
#define RC2IE                         979
#define BCL2IE                        980
#define SSP2IE                        981
#define PIR3                          982
#define TMR1GIF                       983
#define RXBNIF                        984
#define TMR3GIF                       985
#define TMR5GIF                       986
#define CTMUIF                        987
#define TX2IF                         988
#define TXBNIF                        989
#define RC2IF                         990
#define BCL2IF                        991
#define SSP2IF                        992
#define IPR3                          993
#define TMR1GIP                       994
#define TMR3GIP                       995
#define RXBNIP                        996
#define TMR5GIP                       997
#define CTMUIP                        998
#define TXBNIP                        999
#define TX2IP                         1000
#define RC2IP                         1001
#define BCL2IP                        1002
#define SSP2IP                        1003
#define EECON1                        1004
#define RD                            1005
#define WR                            1006
#define WREN                          1007
#define WRERR                         1008
#define FREE                          1009
#define CFGS                          1010
#define EEFS                          1011
#define EEPGD                         1012
#define EECON2                        1013
#define EEDATA                        1014
#define EEADR                         1015
#define EEADR0                        1016
#define EEADR1                        1017
#define EEADR2                        1018
#define EEADR3                        1019
#define EEADR4                        1020
#define EEADR5                        1021
#define EEADR6                        1022
#define EEADR7                        1023
#define RCSTA1                        1024
#define RCSTA1_RX9D                   1025
#define RX9D1                         1026
#define RCD8                          1027
#define RCSTA1_OERR                   1028
#define OERR1                         1029
#define RCSTA1_FERR                   1030
#define FERR1                         1031
#define RCSTA1_ADDEN                  1032
#define RCSTA1_ADEN                   1033
#define ADDEN1                        1034
#define RCSTA1_CREN                   1035
#define CREN1                         1036
#define SRENA                         1037
#define SREN1                         1038
#define RCSTA1_SREN                   1039
#define RC8_9                         1040
#define RCSTA1_RX9                    1041
#define RC9                           1042
#define RX91                          1043
#define RCSTA1_SPEN                   1044
#define SPEN1                         1045
#define TXSTA1                        1046
#define TX9D1                         1047
#define TXSTA1_TX9D                   1048
#define TXD8                          1049
#define TRMT1                         1050
#define TXSTA1_TRMT                   1051
#define BRGH1                         1052
#define TXSTA1_BRGH                   1053
#define TXSTA1_SENDB                  1054
#define SENDB1                        1055
#define TXSTA1_SYNC                   1056
#define SYNC1                         1057
#define TXEN1                         1058
#define TXSTA1_TXEN                   1059
#define TX91                          1060
#define TX8_9                         1061
#define TXSTA1_TX9                    1062
#define TXSTA1_CSRC                   1063
#define CSRC1                         1064
#define TXREG1                        1065
#define TXREG                         1066
#define TX1REG                        1067
#define RCREG1                        1068
#define RCREG                         1069
#define RC1REG                        1070
#define SPBRG1                        1071
#define SPBRG                         1072
#define SP1BRG                        1073
#define SPBRGH1                       1074
#define SP1BRGH                       1075
#define SPBRGH                        1076
#define T3CON                         1077
#define TMR3ON                        1078
#define T3RD16                        1079
#define nT3SYNC                       1080
#define NOT_T3SYNC                    1081
#define SOSCEN3                       1082
#define T3SOSCEN                      1083
#define T3OSCEN                       1084
#define T3CKPS                        1085
#define T3CKPS0                       1086
#define T3CKPS1                       1087
#define TMR3CS0                       1088
#define TMR3CS                        1089
#define TMR3CS1                       1090
